#File generated by Pentaho Translator for package 'org.pentaho.di.trans.steps.clonerow' in locale 'ja_JP'
#
#
#Sat Jan 24 14:29:14 JST 2009
CloneRowDialog.addCloneFlag.Label=\u30d5\u30e9\u30b0\u3092\u8ffd\u52a0\u3059\u308b
CloneRowMeta.CheckResult.NotReceivingFields=\u5148\u884c\u306e\u30b9\u30c6\u30c3\u30d7\u304b\u3089\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowDialog.cloneFlagField.Label=\u30d5\u30a3\u30fc\u30eb\u30c9\u540d
CloneRowDialog.cloneFlagField.Tooltip=\u30d5\u30e9\u30b0\u3092\u8ffd\u52a0\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CloneRowDialog.nrClone.Label=\u30ec\u30b3\u30fc\u30c9\u6570
CloneRow.Log.NrClones=\u5404\u5165\u529b\u884c\u306f{0}\u56de\u8907\u88fd\u3055\u308c\u307e\u3059...
CloneRowMeta.CheckResult.NoInputReceivedFromOtherSteps=\u4ed6\u306e\u30b9\u30c6\u30c3\u30d7\u304b\u3089\u306e\u5165\u529b\u304c\u3042\u308a\u307e\u305b\u3093\u3002
CloneRowDialog.Shell.Title=\u884c\u8907\u88fd
CloneRowDialog.addCloneFlag.Tooltip=\u30d5\u30e9\u30b0\u3092\u8ffd\u52a0\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CheckSum.ErrorInStepRunning=\u30b9\u30c6\u30c3\u30d7\u5b9f\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u767a\u751f
CloneRow.Error.CloneFlagFieldMissing=\u8907\u88fd\u30d5\u30e9\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowMeta.CheckResult.StepRecevingData2=\u4ed6\u306e\u30b9\u30c6\u30c3\u30d7\u60c5\u5831\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059\u3002
CloneRowDialog.nrClone.Tooltip=\u30b3\u30d4\u30fc\u3059\u308b\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CloneRowMeta.Exception.UnexpectedErrorReadingStepInfo=\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u30b9\u30c6\u30c3\u30d7\u60c5\u5831\u8aad\u307f\u8fbc\u307f\u4e2d\u306b\u4e88\u671f\u305b\u306c\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
CloneRowMeta.CheckResult.CloneFlagFieldOk=\u8907\u88fd\u30d5\u30e9\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
CloneRowMeta.CheckResult.CloneFlagFieldMissing=\u8907\u88fd\u30d5\u30e9\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowMeta.Exception.UnableToReadStepInfo=XML\u304b\u3089\u30b9\u30c6\u30c3\u30d7\u60c5\u5831\u3092\u8aad\u307f\u8fbc\u307f\u3067\u304d\u307e\u305b\u3093\u3002
CloneRowMeta.CheckResult.NrClonesOK=\u8907\u88fd\u306e\u884c\u6570\u306f\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
CloneRowDialog.Stepname.Label=\u30b9\u30c6\u30c3\u30d7\u540d 
CloneRow.Log.LineNumber=\u30e9\u30a4\u30f3\u30ca\u30f3\u30d0\u30fc {0}
CloneRowMeta.CheckResult.NrClonesdMissing=\u8907\u88fd\u306e\u884c\u6570\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowMeta.CheckResult.StepRecevingData=\u5148\u884c\u30b9\u30c6\u30c3\u30d7\u3068\u63a5\u7d9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002{0}\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u53d6\u5f97\u3002
CloneRowMeta.Exception.UnexpectedErrorSavingStepInfo=\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30b9\u30c6\u30c3\u30d7\u60c5\u5831\u4fdd\u5b58\u4e2d\u3001\u4e88\u671f\u305b\u306c\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
CloneRowDialog.isNrCloneInField.Label=\u30ec\u30b3\u30fc\u30c9\u756a\u53f7\u3092\u8ffd\u52a0\u3059\u308b
CloneRowDialog.isNrCloneInField.Tooltip=\u30ec\u30b3\u30fc\u30c9\u756a\u53f7\u3092\u8ffd\u52a0\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CloneRowDialog.wlNrCloneField.Label=\u30d5\u30a3\u30fc\u30eb\u30c9\u540d
CloneRowDialog.FailedToGetFields.DialogTitle=\u30a8\u30e9\u30fc
CloneRowDialog.FailedToGetFields.DialogMessage=\u5148\u884c\u306e\u30b9\u30c6\u30c3\u30d7\u304b\u3089\u30d5\u30a3\u30fc\u30eb\u30c9\u60c5\u5831\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
CloneRow.Error.NrCloneInFieldMissing=\u8907\u88fd\u6570\u3092\u683c\u7d0d\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRow.Log.ErrorFindingField=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
CloneRow.Exception.CouldnotFindField=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306b\u30d5\u30a3\u30fc\u30eb\u30c9[{0}]\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 
CloneRowMeta.CheckResult.NrCloneFieldMissing=\u8907\u88fd\u6570\u3092\u683c\u7d0d\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowMeta.CheckResult.NrCloneFieldOk=\u8907\u88fd\u6570\u3092\u683c\u7d0d\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowDialog.wOutpuFields.Label=\u51fa\u529b\u30d5\u30a3\u30fc\u30eb\u30c9
CloneRowDialog.addCloneNum.Label=\u8907\u88fd\u6570\u3092\u51fa\u529b\u306b\u8ffd\u52a0\u3059\u308b
CloneRowDialog.addCloneNum.Tooltip=\u8907\u88fd\u6570(Integer)\u3092\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306b\u8ffd\u52a0\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CloneRowDialog.cloneNumField.Label=\u8907\u88fd\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
CloneRowDialog.cloneNumField.Tooltip=\u8907\u88fd\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
CloneRow.Error.CloneNumFieldMissing=\u8907\u88fd\u6570\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
CloneRowMeta.CheckResult.CloneNumFieldOk=\u8907\u88fd\u6570\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u306f\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
CloneRowMeta.CheckResult.CloneNumFieldMissing=\u8907\u88fd\u6570\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u304c\u3057\u3066\u3044\u3055\u308c\u3066\u307e\u305b\u3093\u3002\!