#File generated by Hitachi Vantara Translator for package 'org.pentaho.di.trans.steps.tablecompare' in locale 'en_US'
#
#
#Mon Nov 21 09:15:42 CET 2011
TableCompareDialog.CompareDB.Label=\u6bd4\u8f03\u63a5\u7d9a
TableCompare.Error.MissingRowFoundInCompareData=Missing row detected in compare table ''{0}'' with key ''{1}''
TableCompare.Exception.KeyFieldsNotSpecified=The field to use as input for the key fields was not specified
TableCompareDialog.ReferenceValueField.Label=\u53c2\u7167\u5024\u306e\u30a8\u30e9\u30fc\u30cf\u30f3\u30c9\u30ea\u30f3\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompare.Exception.UnexpectedErrorConnectingToCompareDatabase=Unable to connect to compare database connection ''{0}''
TableCompare.Exception.ValueCompareFieldNotSpecified=The field to use as output in the error handling for the compare value description was not specified.
TableCompare.Exception.NoKeyFieldsDefined=No key fields defined comparing tables ''{0}'' and ''{1}''
TableCompare.Exception.KeyDescriptionFieldNotSpecified=The field to use as output in the error handling for the key description was not specified.
TableCompareDialog.KeyFieldsField.Label=\u30ad\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.KeyDescField.Label=\u30ad\u30fc\u306e\u30a8\u30e9\u30fc\u30cf\u30f3\u30c9\u30ea\u30f3\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9
IfNullMeta.CheckResult.StepRecevingData=This step is receiving {0} fields from other steps\!
TableCompareDialog.NrErrorsLeftJoinField.Tooltip=\u53c2\u7167\u30c6\u30fc\u30d6\u30eb\u306b\u306e\u307f\u5b58\u5728\u3059\u308b\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u51fa\u529b\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompareDialog.KeyDescField.Tooltip=\u30a8\u30e9\u30fc\u51e6\u7406\u6642\u306b\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3068\u306a\u3063\u305f\u30ad\u30fc\u306e\u8aac\u660e\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3059\u3002
TableCompareDialog.DoMapping.UnableToFindInput=Error getting fields from incoming stream\!
TableCompareMeta.Exception.NrErrorsLeftJoinFieldNotSpecified=The name of the result field for the number of left join errors is not specified.
TableCompare.Error.RecordInReferenceNotFoundInCompareTable=Record in reference table ''{0}'' was not found in compare table with key ''{1}''
TableCompareDialog.KeyFieldsField.Tooltip=\u30ad\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002(\u30ab\u30f3\u30de\u533a\u5207\u308a)
TableCompareDialog.NrRecordsCompareField.Tooltip=\u6bd4\u8f03\u30c6\u30fc\u30d6\u30eb\u306e\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u51fa\u529b\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
IfNullMeta.CheckResult.StepRecevingData2=This step is receiving data from other steps
TableCompare.Exception.ReferenceTableNotSpecified=The field to use as input for the reference table was not specified
TableCompareDialog.NrRecordsReferenceField.Label=\u53c2\u7167\u30c6\u30fc\u30d6\u30eb\u30ec\u30b3\u30fc\u30c9\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.NrErrorsInnerJoinField.Tooltip=\u5171\u901a\u3067\u306a\u3044\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u51fa\u529b\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompare.Error.NumberOfFieldsIsDifferent=The number of fields in reference table ''{0}'' is different ({1}) from the number of fields in compare table ''{2}'' ({3})
TableCompare.Error.CompareRowIsDifferentFromReference=Field difference found between reference and compare data.
TableCompare.Exception.NoCompareTableDefined=No compare table defined for compare operation, skipping row.
TableCompareDialog.CompareValueField.Label=\u6bd4\u8f03\u5024\u306e\u30a8\u30e9\u30fc\u30cf\u30f3\u30c9\u30ea\u30f3\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9
IfNullMeta.CheckResult.NoInputReceivedFromOtherSteps=No input received from other steps\!
TableCompareDialog.NrErrorsInnerJoinField.Label=inner join\u30a8\u30e9\u30fc\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.CompareSchemaField.Label=\u6bd4\u8f03\u30b9\u30ad\u30fc\u30de\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.NrRecordsReferenceField.Tooltip=\u53c2\u7167\u30c6\u30fc\u30d6\u30eb\u306e\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u51fa\u529b\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
TableCompare.Exception.ExcludeFieldsNotSpecified=The field to use as input for the excluded fields was not specified
TableCompareMeta.Exception.NrErrorsRightJoinFieldNotSpecified=The name of the result field for the number of right join errors is not specified.
TableCompareDialog.ReferenceSchemaField.Tooltip=\u53c2\u7167\u3059\u308b\u30b9\u30ad\u30fc\u30de\u540d\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompareDialog.ReferenceTableField.Label=\u53c2\u7167\u30c6\u30fc\u30d6\u30eb\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompare.Exception.CompareTableNotSpecified=The field to use as input for the compare table was not specified
TableCompareDialog.ReferenceDB.Tooltip=\u4f7f\u7528\u3059\u308b\u53c2\u7167\u63a5\u7d9a\u5148\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompareDialog.ReferenceDB.Label=\u53c2\u7167\u63a5\u7d9a
TableCompareDialog.NrErrorsRightJoinField.Tooltip=\u6bd4\u8f03\u30c6\u30fc\u30d6\u30eb\u306b\u306e\u307f\u5b58\u5728\u3059\u308b\u30ec\u30b3\u30fc\u30c9\u6570\u3092\u51fa\u529b\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompareMeta.Exception.NrRecordsReferenceFieldNotSpecified=The name of the result field for the number of records in the reference table is not specified.
TableCompare.Error.KeyFieldWasNotFoundInReferenceTable=Key ''{0}'' was not found in reference table ''{1}''
TableCompare.Exception.CompareSchemaNotSpecified=The field to use as input for the compare schema was not specified
TableCompareDialog.CompareValueField.Tooltip=\u30a8\u30e9\u30fc\u51e6\u7406\u6642\u306b\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3068\u306a\u3063\u305f\u6bd4\u8f03\u5024\u306e\u8aac\u660e\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3059\u3002
TableCompareDialog.CompareTableField.Tooltip=\u6bd4\u8f03\u30c6\u30fc\u30d6\u30eb\u540d\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompare.Exception.ReferenceSchemaNotSpecified=The field to use as input for the reference schema was not specified
TableCompare.Error.ExtraRowFoundInCompareData=Extra row found in compare table ''{0}'' with key ''{1}'' 
TableCompare.Exception.CanNotFindField=Field ''{0}'' is used but can''t be found.
TableCompareDialog.NrErrorsRightJoinField.Label=right join\u30a8\u30e9\u30fc\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.ReferenceValueField.Tooltip=\u30a8\u30e9\u30fc\u51e6\u7406\u6642\u306b\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3068\u306a\u3063\u305f\u53c2\u7167\u5024\u306e\u8aac\u660e\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3059\u3002
TableCompareDialog.ReferenceTableField.Tooltip=\u53c2\u7167\u30c6\u30fc\u30d6\u30eb\u540d\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompare.Exception.UnexpectedErrorComparingTables=An unexpected error occurred during table compare
TableCompareDialog.Stepname.Label=\u30b9\u30c6\u30c3\u30d7\u540d
TableCompareDialog.Shell.Title=\u30c6\u30fc\u30d6\u30eb\u6bd4\u8f03 (contributed by www.kjube.de)
TableCompareDialog.ReferenceSchemaField.Label=\u53c2\u7167\u30b9\u30ad\u30fc\u30de\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.CompareDB.Tooltip=\u6bd4\u8f03\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u63a5\u7d9a\u5148\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompare.Error.KeyFieldWasNotFoundInCompareTable=Key ''{0}'' was not found in compare table ''{1}''
TableCompareDialog.CompareTableField.Label=\u6bd4\u8f03\u30c6\u30fc\u30d6\u30eb\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareMeta.Exception.NrRecordsCompareFieldNotSpecified=The name of the result field for the number of number of records in the compare table is not specified.
TableCompareDialog.NrErrorsLeftJoinField.Label=left join\u30a8\u30e9\u30fc\u6570\u30d5\u30a3\u30fc\u30eb\u30c9 
TableCompare.Exception.UnexpectedErrorConnectingToReferenceDatabase=Unable to connect to reference database connection ''{0}''
IfNullMeta.CheckResult.NotReceivingFields=This step is not receiving fields from other steps\!
TableCompareMeta.Exception.NrErrorsFieldIsNotSpecified=The name of the result field for the number of compare errors is not specified. 
TableCompareDialog.NrRecordsCompareField.Label=\u6bd4\u8f03\u30c6\u30fc\u30d6\u30eb\u30ec\u30b3\u30fc\u30c9\u6570\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompareDialog.NrErrorsField.Tooltip=\u6bd4\u8f03\u7d50\u679c\u306e\u30a8\u30e9\u30fc\u6570\u3092\u51fa\u529b\u3059\u308b\u7d50\u679c\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TableCompareMeta.Exception.NrErrorsInnerJoinFieldNotSpecified=The name of the result field for the number of inner join errors is not specified.
TableCompareDialog.ExcludeFieldsField.Label=\u9664\u5916\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompare.Exception.NoReferenceTableDefined=No reference table defined for compare operation, skipping row.
TableCompareDialog.ExcludeFieldsField.Tooltip=\u9664\u5916\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002(\u30ab\u30f3\u30de\u533a\u5207\u308a)
TableCompare.Exception.ValueReferenceFieldNotSpecified=The field to use as output in the error handling for the reference value description was not specified.
TableCompareDialog.NrErrorsField.Label=\u7d50\u679c\u30d5\u30a3\u30fc\u30eb\u30c9
TableCompare.Error.RecordNotInReferenceFoundInCompareTable=Record found in compare table ''{0}'' was not found in reference table for key ''{1}'' 
TableCompareDialog.CompareSchemaField.Tooltip=\u6bd4\u8f03\u30b9\u30ad\u30fc\u30de\u540d\u3092\u53d6\u5f97\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
