#File generated by Pentaho Translator for package 'org.pentaho.di.job.entries.copymoveresultfilenames' in locale 'ja_JP'
#
#
#Fri Sep 11 14:14:13 JST 2009
JobEntryCopyMoveResultFilenames.AddDate.Tooltip=\u30D5\u30A1\u30A4\u30EB\u540D\u306B\u65E5\u4ED8\u3092\u4ED8\u3051\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.AddDestinationFilename.Tooltip=\u79FB\u52D5\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.RemovedSourceFilename.Label=\u79FB\u52D5\u5F8C\u306B\u53C2\u7167\u5143\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664
JobEntryCopyMoveResultFilenames.AddDestinationFilename.Label=\u79FB\u52D5\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3059\u308B
JobEntryCopyMoveResultFilenames.AddDateBeforeExtension.Label=\u65E5\u4ED8\u3068\u6642\u523B\u3092\u62E1\u5F35\u5B50\u306B\u3059\u308B
JobEntryCopyMoveResultFilenames.CreateDestinationFolder.Label=\u79FB\u52D5\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B
JobEntryCopyMoveResultFilenames.RemovedSourceFilename.Tooltip=\u79FB\u52D5\u5F8C\u306B\u53C2\u7167\u5143\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.OverwriteFile.Tooltip=\u65E2\u5B58\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u7F6E\u304D\u63DB\u3048\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.OverwriteFile.Label=\u65E2\u5B58\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u7F6E\u304D\u63DB\u3048
JobEntryCopyMoveResultFilenames.Action.Label=\u30BF\u30A4\u30D7 
JobEntryCopyMoveResultFilenames.AddDate.Label=\u30D5\u30A1\u30A4\u30EB\u540D\u306B\u65E5\u4ED8\u3092\u4ED8\u3051\u308B
JobEntryCopyMoveResultFilenames.NrErrorsLessThan.Label=\u8A31\u53EF\u3059\u308B\u56DE\u6570
JobEntryCopyMoveResultFilenames.CreateDestinationFolder.Tooltip=\u79FB\u52D5\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.AddDateBeforeExtension.Tooltip=\u30D5\u30A1\u30A4\u30EB\u306E\u62E1\u5F35\u5B50\u3092\u65E5\u4ED8\u3068\u6642\u523B\u306B\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.Name.Label=\u30B8\u30E7\u30D6\u540D
JobEntryCopyMoveResultFilenames.SuccessOn.Group.Label=\u51E6\u7406\u6761\u4EF6\u306E\u8A2D\u5B9A
JobEntryCopyMoveResultFilenames.NrErrorsLessThan.Tooltip=\u8A31\u53EF\u3059\u308B\u56DE\u6570\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.WildcardExclude.Label=\u9664\u5916\u3059\u308B\u30D5\u30A1\u30A4\u30EB
JobEntryCopyMoveResultFilenames.SpecifyFormat.Tooltip=\u65E5\u4ED8\u3068\u6642\u523B\u306E\u8868\u793A\u5F62\u5F0F\u3092\u6307\u5B9A\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.Group.LimitTo.Label=\u30D5\u30A1\u30A4\u30EB\u632F\u5206\u3051\u306E\u8A2D\u5B9A
JobEntryCopyMoveResultFilenames.AddTime.Label=\u30D5\u30A1\u30A4\u30EB\u540D\u306B\u6642\u523B\u3092\u4ED8\u3051\u308B
JobEntryCopyMoveResultFilenames.Wildcard.Label=\u79FB\u52D5\u3059\u308B\u30D5\u30A1\u30A4\u30EB
JobEntryCopyMoveResultFilenames.SpecifyWildcard.Tooltip=\u30D5\u30A1\u30A4\u30EB\u3092\u632F\u5206\u3051\u3059\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.IgnoreRestOfFiles.Label=\u6761\u4EF6\u304C\u6210\u7ACB\u3057\u306A\u3044\u5834\u5408\u306F\u6B8B\u308A\u3092\u51E6\u7406\u3057\u306A\u3044
JobEntryCopyMoveResultFilenames.DateTimeFormat.Label=\u8868\u793A\u5F62\u5F0F
JobEntryCopyMoveResultFilenames.AddTime.Tooltip=\u30D5\u30A1\u30A4\u30EB\u540D\u306B\u6642\u523B\u3092\u4ED8\u3051\u308B\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.SpecifyWildcard.Label=\u30D5\u30A1\u30A4\u30EB\u3092\u632F\u5206\u3051\u3059\u308B
JobEntryCopyMoveResultFilenames.SpecifyFormat.Label=\u65E5\u4ED8\u3068\u6642\u523B\u306E\u8868\u793A\u5F62\u5F0F\u3092\u6307\u5B9A\u3059\u308B
JobEntryCopyMoveResultFilenames.SuccessCondition.Label=\u6761\u4EF6 
JobEntryCopyMoveResultFilenames.WildcardExclude.Tooltip=\u9664\u5916\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u691C\u7D22\u6587\u5B57\u5217\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.Wildcard.Tooltip=\u79FB\u52D5\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u691C\u7D22\u6587\u5B57\u5217\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.IgnoreRestOfFiles.Tooltip=\u6761\u4EF6\u304C\u6210\u7ACB\u3057\u306A\u3044\u3068\u304D\u306B\u30D5\u30A1\u30A4\u30EB\u306E\u6B8B\u308A\u3092\u51E6\u7406\u3057\u306A\u3044\u5834\u5408\u306F\u30C1\u30A7\u30C3\u30AF\u30FB\u30DC\u30C3\u30AF\u30B9\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JobEntryCopyMoveResultFilenames.Foldername.Label=\u79FB\u52D5\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
