<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Kettle Document Map</title>
<link href="images/styles-new.css" rel="stylesheet" type="text/css" />
</head>

<body class="body_doc">
<div class="logo"><a href="http://www.pentaho.org" target="_blank"><img src="images/pentaho_logo.png" alt="Pentaho - Open Source Business Intelligence" width="220" height="65" border="0" /></a></div>
<h1>Bienvenue dans Pentaho Data Integration: Projet Kettle</h1>
Spoon v2.4.0
<p>Pentaho Data Integration fournit des possibilit&eacute;s ETL (Extraction, Transformation, et chargement 'Loading' de donn&eacute;es) en utilisant une approche innovante reposant sur la notion de m&eacute;ta-donn&eacute;e. Vous &ecirc;tes en train d'utiliser Spoon, l'interface graphique de mod&eacute;lisation des t&acirc;ches et transformation de la suite Pentaho Data Integration. Si vous d&eacute;butez avec Pentaho Data Integration, reportez-vous aux liens ci-dessous pour en apprendre plus sur cette suite et devenir un membre actif de la communaut&eacute;.</p>
<h2>Liens concernant la documentation</h2>
<ul>
<li><a href="../../English/Kettle 2.4.0 change log.pdf">Quoi de neuf dans Pentaho Data Integration 2.4 (anglais PDF)</a></li>
<li><a href="../Spoon_2_4_0_Manuel_Utilisateur.pdf">Manuel de l'utilisateur de Spoon (PDF)</a></li>
<li><a href="../Pan-2.4-fr_FR.pdf">Manuel de l'utilisateur de Pan (PDF)</a></li>
<li><a href="../Kitchen-2.4-fr_FR.pdf">Manuel de l'utilisateur de Kitchen (PDF)</a></li>
<li><a href="../Carte-2.4-fr_FR.pdf">Manuel de l'utilisateur de Carte (PDF)</a></li>
</ul>
<h2>Liens de la communaut&eacute;</h2>
<ul>
<li><a href="http://forums.pentaho.org/forumdisplay.php?f=69">Le forum de la communaut&eacute; (anglais)</a> - Discussion sur la mod&eacute;lisation, la configuration, les options et les probl&egrave;mes</li>
<li><a href="http://kettle.pentaho.org/">Page d'accueil de Pentaho Data Integration (anglais)</a> - Nouvelles, &eacute;tude de cas, astuces de la semaine et plus</li>
<li><a href="http://www.pentaho.org/download/">T&eacute;l&eacute;chargements (anglais)</a> - T&eacute;l&eacute;charger la derni&egrave;re version du produit et de la documentation</li>
<li><a href="http://www.javaforge.com/proj/summary.do?proj_id=318">Pentaho Data Integration sur JavaForge</a> - T&eacute;l&eacute;charger le code source et cr&eacute;er des demandes d'am&eacute;lioration</li>
</ul>
<h2>Les Blogs autour de Pentaho</h2>
<ul>
<li><a href="http://www.ibridge.be/">Matt Casters sur l'int&eacute;gration de donn&eacute;es</a> - Responsable chez Pentaho "Data Integration" et fondateur du projet Kettle</li>
<li><a href="http://www.nicholasgoodman.com/bt/blog/">Nicholas Goodman autour de la Business Intelligence</a> - Reporting, OLAP, ETL ...</li>
<li><a href="http://gretchenmoran.blogspot.com/g">Gretchen et la nation Pentaho</a> - Gretchen Moran, developpeur de la communaut&eacute; Pentaho</li>
</ul>
</body>
</html>
