#File generated by Pentaho Transator for package 'org.pentaho.di.trans.steps.regexeval' in locale 'es_AR'


#Thu Dec 06 13:47:53 GMT-03:00 2007
RegexEvalMeta.CheckResult.MatcherOK=El campo ha evaluar ha sido completado
RegexEval.Exception.CouldnotFindField=No se pudo encontrar el campo "{0}" en la fila.
RegexEvalDialog.DotAll.Label=Activar modo dotall
RegexEvalMeta.Exception.UnexpectedErrorInReadingStepInfo=Error inesperado al leer informaci\u00f3n del paso de repositorio
RegexEvalMeta.Exception.UnableToLoadStepInfoFromXML=No se puedo cargar informaci\u00f3n del paso desde XML
RegexEvalDialog.UseVar.Label=Utilizar sustituci\u00f3n de variables
RegexEvalDialog.Unicode.Label=Habilitar
RegexEvalDialog.Multiline.Label=Habilitar modo multil\u00ednea
RegexEvalDialog.DotAll.Tooltip=En el modo dotall, la expresi\u00f3n . coincide con cualquier caracter, incluyendo un terminador de l\u00ednea.\n Por defecto esta expresi\u00f3n no coincide con terminardores de l\u00ednea.\nEl modo dotall tambi\u00e9n puede ser activado a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?s).
RegexEval.Log.ErrorStackTrace=Error\: vuelco de pila\:
RegexEvalMeta.CheckResult.NoMatcher=\u00a1Falta el campo a evaluar\!
RegexEval.Log.ErrorFindingField=Error\: no se encuentra el campo\:
RegexEvalMeta.CheckResult.NoInputReceived=\u00a1No se ha recibido entrada de otros pasos\!
RegexEval.Log.ErrorMatcherMissing=Error\: falta el campo a evaluar
RegexEval.Log.ErrorResultFieldMissing=Error\: falta el campo resultado
RegexEvalDialog.Shell.Title=Evaluaci\u00f3n de expresi\u00f3n regular
RegexEvalDialog.ContentTab.TabTitle=Contenido
RegexEval.Exception.ErrorMatcherMissing=Error\: falta el campo a evaluar
RegexEvalDialogMod.FailedToGetFields.DialogMessage=Hubo un error al obtener los campos de entrada\:
RegexEvalDialog.UseVar.Tooltip=Utilizar sustituci\u00f3n de variables
RegexEvalDialog.CaseInsensitive.Label=Habilita apareo insensible a may\u00fasculas
RegexEvalMeta.CheckResult.ResultFieldnameOK=El nombre del campo resultado ha sido completado
RegexEvalDialog.Unix.Label=Activa el modo de l\u00edneas Unix
RegexEvalDialog.Matcher.Label=Campo a evaluar
RegexEval.Log.ReadRow=Leyendo la fila\:
RegexEvalMeta.CheckResult.ConnectedStepOK=El paso est\u00e1 conectado al anterior, recibiendo {0} campos
RegexEvalDialog.Multiline.Tooltip=En el modo multil\u00ednea las expresiones ^ y $ coinciden justo antes \u00f3 justo despu\u00e9s,\n respectivamente, de un terminado \u00f3 del fin de la secuencia de entrada.\n Por defecto estas expresiones s\u00f3lo coinciden al comienzo y al final de la secuencia de entrada.\nEl modo multil\u00ednea tambi\u00e9n puede ser activado a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?m).
RegexEvalDialog.Comment.Label=Permitir espacios en blanco y comentarios en el patr\u00f3n
RegexEvalDialog.Stepname.Label=Nombre del paso
RegexEvalDialog.CaseInsensitive.Tooltip=CASE_INSENSITIVE para habilitar insensibilidad a may\u00fasculas.\nPor defecto, el apareo no sensible a may\u00fasculas asume que s\u00f3lo se est\u00e1n apareando caracteres US-ASCII.\n Apareo no sensible a may\u00fasculas y compatible con unicode puede ser activado especificando la se\u00f1al UNICODE_CASE junto con esta se\u00f1al.\nEl apareo no sensible a las may\u00fasculas tambi\u00e9n puede ser activado a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?i).
RegexEvalDialog.CanonEq.Tooltip=CANON_EQ para ignorar diferencias en codificaciones Unicod,\n excepto que est\u00e9 seguro de que sus cadenas contienen s\u00f3lo caracteres US ASCII y desea mejorar la performance.
RegexEvalMeta.Exception.UnableToSaveStepInfo=No se puede guardar informaci\u00f3n del paso en el respositorio para id_step\=
RegexEval.Exception.ErrorResultFieldMissing=Error\: falta el campo resultado
RegexEvalDialog.CanonEq.Label=Ignorar diferencias en codificaciones Unicod
RegexEval.Log.UnexpectedeError=Error inesperado en ''
RegexEvalDialog.Script.Label=Expresi\u00f3n regular
RegexEvalDialog.FailedToGetFields.DialogTitle=Error al obtener campos
RegexEval.Log.Regexp=La expresi\u00f3n regular es\:
RegexEvalDialog.Unicode.Tooltip=Cuando esta se\u00f1al es especificada entonces el apareo no sensible a may\u00fasculas,\n si fue activado por la se\u00f1al CASE_INSENSITIVE, es hecho de manera consistente con el est\u00e1ndar Unicode.\nPor defecto, el apareo no sensible a may\u00fasculas asume que s\u00f3lo se est\u00e1n apareando caracteres US-ASCII.\nEsta opci\u00f3n tambi\u00e9n puede ser activada a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?u).
RegexEvalDialog.Javascript.Label=Expresi\u00f3n regular\:
RegexEvalDialog.Comment.Tooltip=En este modo, el espacio en blanco es ignorado,\n y los comentarios embebidos que comienzan con \# son ignorados hasta el fin de una l\u00ednea.\nEl modo de comentarios tambi\u00e9n puede ser activado a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?x).
RegexEvalDialog.Unix.Tooltip=En este modo, s\u00f3lo el terminador de l\u00ednea '\n' es reconocido en el comportamiento de  ., ^, y $.\nEl modo de l\u00edneas Unix tambi\u00e9n puede ser activado a trav\u00e9s de la expresi\u00f3n de se\u00f1al embebida (?d).
RegexEvalDialog.GeneralTab.TabTitle=Opciones
RegexEvalMeta.CheckResult.NoResultFieldname=\u00a1Falta el nombre del campo resultado\!
RegexEval.Log.StartingToRun=Comenzando la ejecuci\u00f3n\:
