ImportRule.Description.TransformationHasDescription=A transformation requires a description
ImportRule.Tooltip.TransformationHasDescription=\u3053\u306e\u30eb\u30fc\u30eb\u306f\u3059\u3079\u3066\u306e\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30e1\u30fc\u30b7\u30e7\u30f3\u306b\u6307\u5b9a\u3057\u305f\u7279\u5b9a\u306e\u9577\u3055\u4ee5\u4e0a\u306e\u8a73\u7d30\u304c\u8a18\u8f09\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002

ImportRule.Description.JobHasDescription=A job requires a description
ImportRule.Tooltip.JobHasDescription=\u3053\u306e\u30eb\u30fc\u30eb\u306f\u3059\u3079\u3066\u306e\u30b8\u30e7\u30d6\u306b\u6307\u5b9a\u3057\u305f\u7279\u5b9a\u306e\u9577\u3055\u4ee5\u4e0a\u306e\u8a73\u7d30\u304c\u8a18\u8f09\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002

ImportRule.Description.TransformationHasTransLogConfigured=A transformation has to log to a transformation log table.
ImportRule.Tooltip.TransformationHasTransLogConfigured=\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u305f\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30e1\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30c6\u30fc\u30d6\u30eb\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u307e\u3059\u3002\u307e\u305f\u3001\u30b9\u30ad\u30fc\u30de\u540d\u3001\u30c6\u30fc\u30d6\u30eb\u540d\u3001\u63a5\u7d9a\u540d\u306b\u4e00\u822c\u7684\u306a\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u304b\u3082\u78ba\u8a8d\u3057\u307e\u3059\u3002

ImportRule.Description.JobHasJobLogConfigured=A job has to log to a job log table.
ImportRule.Tooltip.JobHasJobLogConfigured=\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u305f\u30b8\u30e7\u30d6\u306e\u30ed\u30b0\u30c6\u30fc\u30d6\u30eb\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u307e\u3059\u3002\u307e\u305f\u3001\u30b9\u30ad\u30fc\u30de\u540d\u3001\u30c6\u30fc\u30d6\u30eb\u540d\u3001\u63a5\u7d9a\u540d\u306b\u4e00\u822c\u7684\u306a\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u304b\u3082\u78ba\u8a8d\u3057\u307e\u3059\u3002

ImportRule.Description.DatabaseConfiguration=Validates the configuration of the specified database
ImportRule.Tooltip.DatabaseConfiguration=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u6307\u5b9a\u901a\u308a\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u307e\u3059\u3002

ImportRule.Description.TransformationHasNoDisabledHops=Transformation has no disabled hops
ImportRule.Tooltip.TransformationHasNoDisabledHops=\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30e1\u30fc\u30b7\u30e7\u30f3\u306b\u8aa4\u3063\u3066\u7121\u52b9\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30db\u30c3\u30d7\u304c\u306a\u3044\u304b\u78ba\u8a8d\u3057\u307e\u3059\u3002
 
ImportRule.Description.JobHasNoDisabledHops=Job has no disabled hops
ImportRule.Tooltip.JobHasNoDisabledHops=\u30b8\u30e7\u30d6\u306b\u306b\u8aa4\u3063\u3066\u7121\u52b9\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30db\u30c3\u30d7\u304c\u306a\u3044\u304b\u78ba\u8a8d\u3057\u307e\u3059\u3002

ImportRule.Description.JobHasANote=A job must have a note
ImportRule.Tooltip.JobHasANote=\u3053\u306e\u30eb\u30fc\u30eb\u306f\u30b8\u30e7\u30d6\u306b\u6700\u4f4e\uff11\u3064\u4ee5\u4e0a\u306e\u30ce\u30fc\u30c8\u3092\u6301\u3064\u3053\u3068\u3092\u5f37\u5236\u3057\u307e\u3059\u3002

ImportRule.Description.TransformationHasANote=A transformation must have a note
ImportRule.Tooltip.TransformationHasANote=\u3053\u306e\u30eb\u30fc\u30eb\u306f\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30e1\u30fc\u30b7\u30e7\u30f3\u306b\u6700\u4f4e\uff11\u3064\u4ee5\u4e0a\u306e\u30ce\u30fc\u30c8\u3092\u6301\u3064\u3053\u3068\u3092\u5f37\u5236\u3057\u307e\u3059\u3002
