#File generated by Hitachi Vantara Translator for package 'org.pentaho.di.trans.steps.excelwriter' in locale 'it_IT'
#
#
#Sat Sep 15 18:02:40 CEST 2012
ExcelWriterDialog.FormatXLSX.Label=xlsx [Excel 2007 e superiore]
ExcelWriterDialog.UseStyleCell.Column=Stile da cella
ExcelWriterDialog.ProtectSheet.Tooltip=Blocca il foglio in modifica impostando una password
ExcelWriterDialog.MakeActiveSheet.Tooltip=Se selezionato, il foglio di output verr\u00E0 impostato come attivo (cio\u00E8 il primo foglio all''apertura del documento) nel file. Se non selezionato, qualsiasi altro foglio precedentemente attivo continuer\u00E0 ad esserlo.
ExcelWriterDialog.Password.Label=Password
ExcelWriterDialog.FormulaField.Column=il campo contiene la formula
ExcelWriterDialog.SplitEvery.Tooltip=Inserire un numero positivo per creare un nuovo output ogni ... righe di dati. I file verranno numerati.
ExcelWriterDialog.IfFileExists.Reuse.Label=Utilizzare il file esistente per la scrittura
ExcelWriterDialog.ProtectedBy.Tooltip=Il nome dell''utente che protegge il foglio
ExcelWriterDialog.CommentAuthor.Column=Cella commento autore (XLSX)
ExcelWriterDialog.RowWritingMethod.Label=Quando scrivi le righe
ExcelWriterDialog.Header.Label=Scrivi intestazione
ExcelWriterDialog.writeToExistingGroup.Label=Quando scrivi sul foglio esistente
ExcelWriterDialog.DateTimeFormat.Label=Formato data/ora
ExcelWriterDialog.Filename.Label=Nomefile
ExcelWriterDialog.Filename.Tooltip=Questo \u00E8 il nome del file Excel in cui verranno scritte le righe
ExcelWriterDialog.fieldGroup.Label=Campi
ExcelWriterDialog.NoFilesFound.DialogMessage=Nessun file trovato\! Per favore controllare file/cartella e le opzioni.
ExcelWriterDialog.ContentGroup.Label=Opzioni del contenuto
ExcelWriterDialog.SkipRows.Label=Offset di ... righe
ExcelWriterDialog.SpecifyFormat.Label=Specifica il formato di data/ora
ExcelWriterDialog.SelectOutputFiles.DialogTitle=File di output
ExcelWriterDialog.MinWidth.Button=Larghezza &minima
ExcelWriterDialog.SpecifyFormat.Tooltip=Specifica il formato di data/ora
ExcelWriterDialog.TemplateSheet.Tooltip=Quando \u00E8 richiesto un nuovo foglio di output e quest''opzione \u00E8 selezionata, il foglio modello verr\u00E0 clonato invece di creare un foglio vuoto. Il foglio modello non deve contenere grafici complessi, poich\u00E9 potrebbere venire perduti o causare errore durante la clonazione. Altri contenuti o formattazioni vanno bene.
ExcelWriterStepMeta.CheckResult.AllFieldsFound=Tutti i campi di output sono stati trovati nell''input stream.
ExcelWriterDialog.DoNotOpenNewFileInit.Tooltip=Selezionare qua per non creare il file quando la trasformazione inizia. PDI creer\u00E0 il file alla prima riga ricevuta.
ExcelWriterDialog.FormatXLS.Label=xls [Excel 97 e superiorie
ExcelWriterDialog.IfSheetExists.CreateNew.Label=sostituisci con il nuovo foglio
ExcelWriterStepMeta.CheckResult.FilesNotChecked=Le specifiche del file non sono state selezionate.
ExcelWriterDialog.Sheetname.Tooltip=Il nome del foglio che verr\u00E0 usato per scrivere i dati.
ExcelWriterDialog.FileTab.TabTitle=File && Foglio
ExcelWriterDialog.RowWritingMethod.Tooltip=Nella scrittura delle righe si pu\u00F2 scegliere di scrivere nelle righe esistenti oppure di spostare prima in basso il contenuto esistente. Pu\u00F2 essere utile ad esempio per mantenere il pi\u00E9 di pagina esistente da modello.
ExcelWriterDialog.IfFileExists.Tooltip=Specifica cosa fare quando esiste il file di output. Si pu\u00F2 scegliere di cancellarlo e di sostituirlo con un nuovo file o riutilizzare il file esistente per la scrittura.
ExcelWriterDialog.TypeColumn.Column=Tipo
ExcelWriterDialog.TemplateSheet.Label=Utilizza il modello quando vengono creati nuovi fogli
ExcelWriterDialog.AutoSize.Label=Auto dimensionamento colonne
ExcelWriterDialog.UseTitleStyleCell.Column=Stile intestazione/pi\u00E9 di pagina dalla cella
ExcelWriterDialog.StreamData.Label=Flusso dati XSLX
ExcelWriterDialog.AutoSize.Tooltip=Dimensiona automaticamente tutte le colonne al valore pi\u00F9 largo. Pu\u00F2 risultare lento sui fogli grandi. Le VMin modalit\u00E0 headless potrebbero richiedere la propriet\u00E0 java.awt.headless\: System.setProperty("java.awt.headless", "true"); oppure java -Djava.awt.headless\=true per poter funzionare.
ExcelWriterStep.Log.OpeningFile=Apertura del file [{0}]...
ExcelWriterDialog.EmptyRows.Tooltip=Quando viene scritto un file esistente si pu\u00F2 scegliere di scrivere prima alcune righe vuote.\nQuesto \u00E8 utile se si vogliono accodare le righe ad un file esistente, traslando queste per meglio vedere i confini di ogni blocco di righe.
ExcelWriterDialog.Template.Tooltip=Quando \u00E8 richiesto un nuovo file di output e quest''opzione \u00E8 selezionata, verr\u00E0 copiato il file modello invece di creare un file vuoto.
ExcelWriterDialog.Header.Tooltip=Scrive i nomi dei campi (od i titoli dei campi se specificato) come prima riga dell''output.
ExcelWriterDialog.IfFileExists.CreateNew.Label=sostituisci con il nuovo file di output
ExcelWriterDialog.sheetGroup.Label=Foglio
ExcelWriterDialog.Footer.Label=Scrivi pi\u00E9 di pagina
ExcelWriterDialog.MakeActiveSheet.Label=Rendi il foglio attivo
ExcelWriterDialog.IfSheetExists.Reuse.Label=scrivi nel foglio esistente
ExcelWriterDialog.StartingCell.Label=Inizia a scrivere nella cella
ExcelWriterDialog.DoNotOpenNewFileInit.Label=Attendi la prima riga prima di creare il file
ExcelWriterDialog.AppendLines.Tooltip=Se selezionato,l''output comincia dopo l''ultima riga definita nel foglio excel esistente.
ExcelWriterDialog.OmitHeader.Tooltip=Si pu\u00F2 scegliere di non scrivere l''intestazione nel caso di scrittura su file esistente. Questo \u00E8 utile per generare nuovi file con intestazione, ma senza ripetere l''intestazione nelle successive esecuzioni, quando si accoda lo stesso file.
ExcelWriterDialog.DialogTitle=Excel Writer Step v1.2 by type-exit.org
ExcelWriterDialog.SelectOutputFiles.DialogMessage=File di output\:
ExcelWriterDialog.ShowFiles.Button=&Mostra file...
ExcelWriterDialog.TemplateFilename.Label=File modello
ExcelWriterDialog.TitleColumn.Column=Titolo campo
ExcelWriterStepMeta.CheckResult.FieldsNotFound=Campi non trovati nell''input stream\:\n\n{0}
ExcelWriterDialog.AddFileToResult.Label=Aggiungi i nomi file al risultato
ExcelWriterDialog.FormatColumn.Column=Formato
ExcelWriterDialog.ProtectSheet.Label=Proteggere il fogli? (solo formato XLS)
ExcelWriterStep.Log.FileOpened=Il file [{0}] \u00E8 stato aperto.
ExcelWriterStepMeta.CheckResult.ExpectedInputError=Nessun input ricevuto dagli altri passi\!
ExcelWriterStep.Log.TemplateMissing=Impossibile trovare il file modello [{0}]\!
ExcelWriterDialog.EmptyRows.Label=Inizia scrivendo ... linee vuote
ExcelWriterDialog.HyperLinkField.Column=Hyperlink
ExcelWriterStep.Log.CouldNotDeleteStaleFile=Impossibile cancellare il file di stallo [{0}]\!
ExcelWriterDialog.IfSheetExists.Label=se il foglio esiste nel file di output
ExcelWriterDialog.Sheetname.Label=Nome del foglio
ExcelWriterDialog.RowWritingMethod.Overwrite.Label=sovrascrivi le celle esistenti
ExcelWriterDialog.Footer.Tooltip=Scrive i nomi dei campi (o titoli dei campi se specificato) come ultima riga dell''output.
ExcelWriterDialog.StartingCell.Tooltip=Inserire il riferimento della cella da cui iniziare la scrittura, es. B2
ExcelWriterDialog.ContentTab.TabTitle=Contenuto
ExcelWriterDialog.ProtectedBy.Label=Protetto dall''utente
ExcelWriterDialog.IfSheetExists.Tooltip=se il foglio esisten nel file, si pu\u00F2 scegliere di cancellarlo e di sostituirlo con un nuovo foglio o riutilizzare il foglio esistente per la scrittura.
ExcelWriterDialog.Extension.Tooltip=Questa \u00E8 l''estensione del file Excel. Implica anche il formato del file.
ExcelWriterDialog.RowWritingMethod.PushDown.Label=Sposta le celle esistenti in basso
ExcelWriterDialog.fileGroup.Label=File
ExcelWriterDialog.NameColumn.Column=Nome
ExcelWriterDialog.Password.Tooltip=Password per proteggere il foglio
ExcelWriterDialog.Template.Label=Utilizza un modello per la creazione di nuovi file
ExcelWriterDialog.TemplateGroup.Label=Modello
ExcelWriterDialog.ForceFormulaRecalculation.Tooltip=Selezionare qua per fare valutare a Kettle tutte le formule del foglio, una volta terminato. E'' utile se si pensa che Excel stia mostrando valori della cache (e quindi sbagliati) nei campi formula.
ExcelWriterDialog.IfFileExists.Label=se il file di output esiste
ExcelWriterDialog.SkipRows.Tooltip=Si pu\u00F2 scegliere di spostare la riga di output iniziale di un numero positivo o negativo. Pu\u00F2 essere utile specificare uno spostamento negativo nel caso di accodamento a foglio esistente, mantenendo le linee del pi\u00E9 di pagina esistente in fondo al foglio.
ExcelWriterDialog.AddStepnr.Label=Includere il numero del passo nel nomefile?
ExcelWriterDialog.OmitHeader.Label=Ometti l''intestazione
ExcelWriterDialog.AddFileToResult.Tooltip=Selezionare qua per aggiungere i nomi file al risultato.
ExcelWriterDialog.AddTime.Label=Includere l''orario nel nomefile?
ExcelWriterDialog.CommentField.Column=Commento cella (XLSX)
ExcelWriterDialog.AddDate.Label=Includere la data nel nome file?
ExcelWriterDialog.SplitEvery.Label=Separa ogni ... righe di dati
ExcelWriterDialog.MinWidth.Tooltip=Imposta l''output alla larghezza senza pad.
ExcelWriterDialog.TemplateSheetname.Label=Foglio modello
ExcelWriterStepMeta.CheckResult.ExpectedInputOk=Il passo sta ricevendo informazioni dagli altri passi.
ExcelWriterDialog.LeaveExistingStylesUnchanged.Tooltip=Quest''impostazione lascer\u00E0 tutti gli stili delle celle esistenti in un modello separato. Pu\u00F2 essere utile se si ha un''area preformattata nel foglio in cui si vogliono sostituire i dati, lasciando invariate tutte le informazioni di stile (come i bordi, lo sfondo, ...).
ExcelWriterDialog.ForceFormulaRecalculation.Label=Forza il ricalcolo della formula
ExcelWriterDialog.AppendLines.Label=Inizia a scrivere alla fine del foglio (accoda linee)
ExcelWriterStepMeta.CheckResult.FieldsReceived=Il passo \u00E8 connesso al precedente, ricezione di {0} campi
ExcelWriterDialog.LeaveExistingStylesUnchanged.Label=Lascia invariati gli stili delle celle esistenti
