#File generated by Pentaho Translator for package 'org.pentaho.di.pan' in locale 'ja_JP'
#
#
#Fri Sep 11 17:09:17 JST 2009
Pan.Log.Finished=\u7D42\u4E86\u3057\u307E\u3057\u305F\u3002
Pan.Log.FindingRep=\u30EA\u30DD\u30B8\u30C8\u30EA [{0}] \u3092\u63A2\u3057\u3066\u3044\u307E\u3059\u3002
Pan.Log.ParsingCommandline=\u89E3\u6790\u30B3\u30DE\u30F3\u30C9\u30FB\u30E9\u30A4\u30F3\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3
Pan.Error.UnableReadXML=\u30A8\u30E9\u30FC\: \u30EA\u30DD\u30B8\u30C8\u30EAXML\u30D5\u30A1\u30A4\u30EB\u3092\u8AAD\u307F\u8FBC\u307F\u3001\u89E3\u6790\u304C\u3067\u304D\u307E\u305B\u3093\u3002
Pan.Log.LoadingAvailableRep=\u5229\u7528\u53EF\u80FD\u306A\u30EA\u30DD\u30B8\u30C8\u30EA\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
Pan.ComdLine.NoRep=\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u30ED\u30AE\u30F3\u30B0\u3057\u307E\u305B\u3093\u3002
Pan.Log.ListReps=\u30EA\u30DD\u30B8\u30C8\u30EA\u306E\u30EA\u30B9\u30C8\:
Pan.Error.NoTransNameSupplied=\u30A8\u30E9\u30FC\: \u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u540D\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u3069\u308C\u3092\u8D77\u52D5\u3059\u3079\u304D\u3067\u3059\u304B\uFF1F
Pan.Error.UnablePrepareInitTrans=\u3053\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u6E96\u5099\u3001\u521D\u671F\u5316\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
Pan.Log.FinishedExportObjectsRepToFile=\u30D5\u30A1\u30A4\u30EB [{0}] \u3078\u306E\u30EA\u30DD\u30B8\u30C8\u30EA\u5185\u306E\u5168\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u304C\u7D42\u4E86\u3057\u307E\u3057\u305F\u3002
Pan.ComdLine.SafeMode=\u30BB\u30FC\u30D5\u30E2\u30FC\u30C9\u3067\u8D77\u52D5\u3057\u307E\u3059\u3002
Pan.ComdLine.LogFile=\u66F8\u304D\u51FA\u3059\u305F\u3081\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB
Pan.ComdLine.ListTransDir=\u6307\u5B9A\u3055\u308C\u305F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u8868\u793A\u3057\u307E\u3059\u3002
Pan.Log.LoadTransInfo=\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u60C5\u5831\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
Pan.ComdLine.ListParam=\u6307\u5B9A\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30E9\u30E1\u30FC\u30BF\u60C5\u5831\u3092\u8868\u793A\u3057\u307E\u3059\u3002
Pan.Log.CheckSuppliedUserPass=\u30E6\u30FC\u30B6\u540D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u307E\u3059\u3002
Pan.ComdLine.LogOldFile=\u66F8\u304D\u51FA\u3059\u305F\u3081\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB
Pan.Log.ErrorOccurred=\u30A8\u30E9\u30FC\u3092\u898B\u3064\u3051\u307E\u3057\u305F\: {0}
Pan.Error.ProcessStopError=\u30A8\u30E9\u30FC\u306E\u305F\u3081\u51E6\u7406\u304C\u505C\u6B62\u3057\u307E\u3057\u305F\: {0}
Pan.Log.GettingListTransDirectory=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u30FB\u30EA\u30B9\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3059\: {0}
Pan.Error.CanNotFindSpecifiedDirectory=\u30A8\u30E9\u30FC\: \u6307\u5B9A\u3057\u305F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC [{0}] \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
Pan.ComdLine.RepPassword=\u30EA\u30DD\u30B8\u30C8\u30EA\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9
Pan.ComdLine.RepUsername=\u30EA\u30DD\u30B8\u30C8\u30EA\u30FB\u30E6\u30FC\u30B6\u540D
Pan.ComdLine.ExpObjectsXML=\u5168\u3066\u306E\u30EA\u30DD\u30B8\u30C8\u30EA\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u3072\u3068\u3064\u306EXML\u30D5\u30A1\u30A4\u30EB\u306B\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
Pan.Log.KettleVersion=Kettle\u30D0\u30FC\u30B8\u30E7\u30F3 {0}, \u30D3\u30EB\u30C9 {1}, \u30D3\u30EB\u30C9\u65E5\u4ED8 \: {2}
Pan.ComdLine.ListReps=\u5229\u7528\u53EF\u80FD\u306A\u30EA\u30DD\u30B8\u30C8\u30EA\u3092\u8868\u793A\u3057\u307E\u3059\u3002
Pan.ComdLine.Param=\u30D1\u30E9\u30E1\u30FC\u30BF <NAME>\=<VALUE> \u3092\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002ex.  -param\:FOO\=bar
Pan.ComdLine.RepName=\u30EA\u30DD\u30B8\u30C8\u30EA\u540D
Pan.Error.CommandLineError=\u30B3\u30DE\u30F3\u30C9\u30FB\u30E9\u30A4\u30F3\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
Pan.Error.CanNotVerifyUserPass=\u30A8\u30E9\u30FC\: \u30E6\u30FC\u30B6\u540D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u78BA\u8A8D\u3067\u304D\u307E\u305B\u3093\u3002
Pan.Error.NoRepsDefined=\u30A8\u30E9\u30FC\: \u3053\u306E\u30B7\u30B9\u30C6\u30E0\u306B\u30EA\u30DD\u30B8\u30C8\u30EA\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
Pan.Log.AllocateTrans=\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u5272\u308A\u632F\u308A\u307E\u3059\u3002
Pan.ComdLine.ListDirRep=\u30EA\u30DD\u30B8\u30C8\u30EA\u5185\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u8868\u793A\u3057\u307E\u3059\u3002
Pan.Log.LoadingTransJar=JAR\u30D5\u30A1\u30A4\u30EB [{0}] \u304B\u3089\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
Pan.Log.GettingListReps=\u30EA\u30DD\u30B8\u30C8\u30EA\u306E\u30EA\u30B9\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
Pan.ComdLine.XMLTransFile=\u8D77\u52D5\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u540D\uFF08XML\u5185\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u30FB\u30D5\u30A1\u30A4\u30EB\uFF09
Pan.Log.Allocate&ConnectRep=\u30EA\u30DD\u30B8\u30C8\u30EA\u3092\u5272\u308A\u632F\u308A\u3001\u63A5\u7D9A\u3057\u307E\u3059\u3002
Pan.Error.CanNotLoadTrans=\u30A8\u30E9\u30FC\: \u30EA\u30DD\u30B8\u30C8\u30EA\u304C\u898B\u3064\u304B\u3089\u305A\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u304C\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
Pan.Error.ReadingJar=JAR\u30D5\u30A1\u30A4\u30EB\u8AAD\u307F\u8FBC\u307F\u4E2D\u306B\u30A8\u30E9\u30FC\u3092\u898B\u3064\u3051\u307E\u3057\u305F\u3002
Pan.Error.NoRepProvided=\u30A8\u30E9\u30FC\: \u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u304C\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u305F\u3081Pan\u51E6\u7406\u304C\u7D99\u7D9A\u3067\u304D\u307E\u305B\u3093\u3002
Pan.Log.ExportingObjectsRepToFile=\u30D5\u30A1\u30A4\u30EB [{0}] \u306B\u30EA\u30DD\u30B8\u30C8\u30EA\u5185\u306E\u5168\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
Pan.Log.AllocatteNewTrans=\u65B0\u898F\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u5272\u308A\u632F\u308A\u307E\u3059\u3002
Pan.ComdLine.TransName=\u8D77\u52D5\u3059\u308B\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u540D
Pan.ComdLine.JarFile=JAR\u30D5\u30A1\u30A4\u30EB\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
Pan.Log.LoadingTransXML=XML\u30D5\u30A1\u30A4\u30EB [{0}] \u304B\u3089\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30E1\u30FC\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
