#File generated by Pentaho Translator for package 'org.pentaho.di.trans.steps.gpbulkloader' in locale 'ja_JP'
#
#
#Mon Sep 14 15:29:03 JST 2009
GPLoadDialog.InvalidConnection.DialogMessage=\u9069\u6B63\u306A\u63A5\u7D9A\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GPLoadDialog.Shell.Title=GPLoad
GPLoadMeta.CheckResult.MissingFieldsToLoadInTargetTable=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30C6\u30FC\u30D6\u30EB\u5185\u306B\u30ED\u30FC\u30C9\u3059\u308B\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
GPLoad.Log.ExitValueSqlldr=Exit value
GPLoadMeta.Exception.ConnectionNotDefined=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u63A5\u7D9A\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u5FC5\u8981\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadDialog.CouldNotBuildSQL.DialogMessage=\u30A8\u30E9\u30FC\u306E\u305F\u3081SQL\u6587\u3092\u30D3\u30EB\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadMeta.CheckResult.StepReceivingDatas=\u30B9\u30C6\u30C3\u30D7\u304C\u5148\u884C\u306B\u63A5\u7D9A\u3057\u307E\u3057\u305F\u3002\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u53D6\u5F97\u3057\u3066\u3044\u307E\u3059\u3002
GPLoadMeta.CheckResult.AllFieldsFoundInTargetTable=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30B9\u30C8\u30EA\u30FC\u30E0\u5185\u306B\u5168\u3066\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
GPLoadMeta.CheckResult.CouldNotReadTableInfo=\u30C6\u30FC\u30D6\u30EB\u60C5\u5831\u304C\u8AAD\u307F\u8FBC\u3081\u307E\u305B\u3093\u3002\u30C6\u30FC\u30D6\u30EB\u540D\u3068\u6A29\u9650\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GPLoadMeta.CheckResult.TableExists=\u30C6\u30FC\u30D6\u30EB\u306F\u5B58\u5728\u3057\u3001\u30C7\u30FC\u30BF\u8AAD\u307F\u8FBC\u307F\u304C\u53EF\u80FD\u3067\u3059\u3002
GPLoadDialog.Log.GettingKeyInfo=\u30AD\u30FC\u60C5\u5831\u3092\u53D6\u5F97\u3057\u3066\u3044\u307E\u3059\u3002
GPLoadDialog.TruncateLoadAction.Label=\u30C8\u30E9\u30F3\u30B1\u30FC\u30C8
GPLoadDialog.ControlFile.Label=\u5236\u5FA1\u30D5\u30A1\u30A4\u30EB\u540D
GPLoadDialog.Stepname.Label=\u30B9\u30C6\u30C3\u30D7\u540D
GPLoadMeta.GetSQL.NotReceivingAnyFields=\u5148\u884C\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u30D5\u30A3\u30FC\u30EB\u30C9\u60C5\u5831\u304C\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002\u30A8\u30E9\u30FC\u304A\u3088\u3073\u30DB\u30C3\u30D7\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GPLoadDialog.FailedToGetFields.DialogTitle=\u30D5\u30A3\u30FC\u30EB\u30C9\u53D6\u5F97\u306E\u5931\u6557
GPLoadMeta.Exception.TableNotSpecified=\u6307\u5B9A\u3055\u308C\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30C6\u30FC\u30D6\u30EB\u540D\u304C\u898B\u3064\u304B\u3089\u306A\u3044\u305F\u3081\u3001\u5FC5\u8981\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadMeta.Exception.UnexpectedErrorReadingStepInfoFromRepository=\u30EA\u30DD\u30B8\u30C8\u30EA\u304B\u3089\u30B9\u30C6\u30C3\u30D7\u60C5\u5831\u306E\u8AAD\u307F\u8FBC\u307F\u4E2D\u306B\u4E88\u671F\u305B\u306C\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
GPLoadDialog.MaxErrors.Label=\u30A8\u30E9\u30FC\u306E\u6700\u5927\u6570
GPLoadDialog.DoMapping.SomeFieldsNotFoundContinue=\u30DE\u30C3\u30D4\u30F3\u30B0\u5185\u306B\u7279\u5B9A\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u51E6\u7406\u3092\u7D99\u7D9A\u3057\u307E\u3059\u304B\uFF1F
GPLoadMeta.DefaultTableName=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30ED\u30FC\u30C9\u30FB\u30C6\u30FC\u30D6\u30EB\u540D
GPLoadMeta.Exception.ErrorGettingFields=\u5FC5\u8981\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadDialog.LoadMethod.Label=\u30ED\u30FC\u30C9\u65B9\u5F0F
GPLoadDialog.SQL.Button=\ &SQL
GPLoadDialog.TargetSchema.Label=\u30B9\u30AD\u30FC\u30DE\u540D
GPLoadDialog.ManualLoadMethod.Label=\u624B\u52D5\u3067\u306E\u30ED\u30FC\u30C9\uFF08\u30D5\u30A1\u30A4\u30EB\u4F5C\u6210\u6642\u306E\u307F\uFF09
GPLoadDialog.LoadAction.Label=\u30ED\u30FC\u30C9\u30BF\u30A4\u30D7
GPLoadDialog.Browse.Button=\u53C2\u7167(&B)...
GPLoadDialog.EraseFiles.Label=\u4F7F\u7528\u5F8C\u306B\u5236\u5FA1\u30D5\u30A1\u30A4\u30EB\u3068\u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3059\u308B
GPLoadDialog.DoMapping.UnableToFindSourceFields.Message=\u30A8\u30E9\u30FC\u306E\u305F\u3081\u3053\u306E\u30B9\u30C6\u30C3\u30D7\u306E\u30BD\u30FC\u30B9\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
GPLoadDialog.PsqlPath.Label=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D5\u30A1\u30A4\u30EB\u540D
GPLoadDialog.InsertLoadAction.Label=\u30A4\u30F3\u30B5\u30FC\u30C8
GPLoadDialog.DateMask.Label=\u65E5\u4ED8
GPLoadDialog.DoMapping.UnableToFindSourceFields.Title=\u30BD\u30FC\u30B9\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u53D6\u5F97\u4E2D\u306E\u30A8\u30E9\u30FC
GPLoadMeta.GetSQL.ErrorOccurred=\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\:
GPLoadMeta.CheckResult.MissingFieldsInInput3=\u5148\u884C\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u30D5\u30A3\u30FC\u30EB\u30C9\u60C5\u5831\u304C\u8AAD\u307F\u8FBC\u3081\u307E\u305B\u3093\u3002
GPLoadDialog.DoMapping.UnableToFindTargetFields.Title=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u53D6\u5F97\u4E2D\u306E\u30A8\u30E9\u30FC
GPLoadDialog.Log.FoundFields={0} \u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
GPLoadDialog.DoMapping.SomeSourceFieldsNotFound=\u30BD\u30FC\u30B9\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\\\\\\\: {0}
GPLoadDialog.DoMapping.UnableToFindTargetFields.Message=\u30A8\u30E9\u30FC\u306E\u305F\u3081\u3053\u306E\u30B9\u30C6\u30C3\u30D7\u306E\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\\\:
GPLoadDialog.FailedToGetFields.DialogMessage=\u30A8\u30E9\u30FC\u306E\u305F\u3081\u5148\u884C\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
GPLoadDialog.StepMeta.Title=GPLoad
GPLoadDialog.Filetype.All=All
GPLoadDialog.TargetTable.Label=\u30C6\u30FC\u30D6\u30EB\u540D
GPLoadDialog.NoSQLNeeds.DialogTitle=OK
GPLoadDialog.SQLError.DialogTitle=\u30A8\u30E9\u30FC
GPLoadDialog.GetFields.Label=\u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u53D6\u5F97(&G)
GPLoadDialog.ColumnInfo.StreamField=\u30B9\u30C8\u30EA\u30FC\u30E0\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9
GPLoadMeta.CheckResult.TableNameOK=\u30C6\u30FC\u30D6\u30EB\u540D\u306FOK\u3067\u3059\u3002
GPLoadMeta.CheckResult.InvalidConnection=\u63A5\u7D9A\u3092\u9078\u629E\u307E\u305F\u306F\u65B0\u898F\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GPLoadMeta.Exception.UnableToReadStepInfoFromXML=XML\u304B\u3089\u30B9\u30C6\u30C3\u30D7\u60C5\u5831\u3092\u8AAD\u307F\u8FBC\u3081\u307E\u305B\u3093\u3002
GPLoadDialog.Encoding.Tooltip=\u30C7\u30FC\u30BF\u306B\u3069\u306E\u30AD\u30E3\u30E9\u30AF\u30BF\u30BB\u30C3\u30C8\u3092\u4F7F\u7528\u3059\u3079\u304D\u304B\uFF08\u7A7A\u306E\u5834\u5408\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B8\u30E7\u30D6\u30A8\u30F3\u30B3\u30FC\u30C9)
GPLoadDialog.InvalidConnection.DialogTitle=\u30A8\u30E9\u30FC
GPLoadDialog.CouldNotBuildSQL.DialogTitle=SQL\u6587\u3092\u30D3\u30EB\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadDialog.Fields.Label=\u30D5\u30A3\u30FC\u30EB\u30C9
GPLoadMeta.CheckResult.StepReceivingInfoFromOtherSteps=\u30B9\u30C6\u30C3\u30D7\u306F\u4ED6\u306E\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u60C5\u5831\u3092\u53D6\u5F97\u3057\u3066\u3044\u307E\u3059\u3002
GPLoadDialog.DoMapping.SomeFieldsNotFoundTitle=\u7279\u5B9A\u306E\u53C2\u7167\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\\
GPLoadMeta.Exception.UnableToSaveStepInfoToRepository=\u30B9\u30C6\u30C3\u30D7\u60C5\u5831\u3092id_step\=\u306E\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u4FDD\u5B58\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadMeta.CheckResult.NoInputError=\u4ED6\u306E\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u306E\u5165\u529B\u60C5\u5831\u304C\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadDialog.LogFile.Label=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u540D
GPLoadDialog.DataFile.Label=\u30C7\u30FC\u30BF\u30FB\u30D5\u30A1\u30A4\u30EB\u540D
GPLoadMeta.CheckResult.MissingFieldsInInput=\u5148\u884C\u30B9\u30C6\u30C3\u30D7\u304B\u3089\u306E\u5165\u529B\u306B\u30D5\u30A3\u30FC\u30EB\u30C9\u60C5\u5831\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
GPLoadMeta.Exception.TableNotFound=\u6307\u5B9A\u3055\u308C\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u898B\u3064\u304B\u3089\u306A\u3044\u305F\u3081\u3001\u5FC5\u8981\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
GPLoadDialog.DoMapping.SomeTargetFieldsNotFound=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\\\\\\\: {0}
GPLoadDialog.ColumnInfo.TableField=\u30D5\u30A3\u30FC\u30EB\u30C9\u540D
GPLoadDialog.ColumnInfo.DateMask=\u65E5\u4ED8\u30DE\u30B9\u30AF
GPLoadDialog.Encoding.Label=\u6587\u5B57\u30B3\u30FC\u30C9
GPLoadDialog.EditMapping.Label=\u30DE\u30C3\u30D4\u30F3\u30B0\u7DE8\u96C6
GPLoadMeta.CheckResult.AllFieldsFoundInInput=\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u5185\u306B\u5168\u3066\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
GPLoadDialog.DateTimeMask.Label=\u65E5\u4ED8/\u6642\u9593
GPLoadDialog.DbNameOverride.Label=\u512A\u5148\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u540D
GPLoadMeta.GetSQL.NoTableDefinedOnConnection=\u3053\u306E\u63A5\u7D9A\u306B\u30C6\u30FC\u30D6\u30EB\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
GPLoadDialog.NoSQLNeeds.DialogMessage=\u30B9\u30C6\u30C3\u30D7\u95A2\u6570\u306E\u4F5C\u6210\u306B\u969B\u3057\u3066SQL\u3092\u5B9F\u884C\u3059\u308B\u5FC5\u8981\u306F\u3042\u308A\u307E\u305B\u3093\u3002
GPLoadMeta.GetSQL.NoConnectionDefined=\u3053\u306E\u30B9\u30C6\u30C3\u30D7\u5185\u306B\u63A5\u7D9A\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
GPLoadDialog.ReplaceLoadAction.Label=\u7F6E\u63DB
GPLoadMeta.CheckResult.DatabaseErrorOccurred=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
