#File generated by Pentaho Translator for package 'org.pentaho.di.core.logging' in locale 'es_AR'
#
#
#Wed Nov 04 17:24:40 ARST 2009
LogWriter.Level.Detailed.LongDesc=Logueo detallado
TransLogTable.FieldDescription.LogField=El campo que contendr\u00E1 el texto completo del log de la ejecuci\u00F3n. Generalmente este es un campo de tipo CLOB \u00F3 TEXT.
PerformanceLogTable.FieldDescription.SeqNr=Un n\u00FAmero secuencial para separar los registros de captura (1..N)
PerformanceLogTable.FieldDescription.LogDate=Fecha y hora de la captura
TransLogTable.FieldDescription.LinesRejected=El n\u00FAmero de l\u00EDneas rechazados por el manejo de errores del paso indicado.
TransLogTable.FieldDescription.LinesUpdated=El n\u00FAmero de sentencias de actualizaci\u00F3n ejecutadas por el paso indicado.
PerformanceLogTable.FieldDescription.LinesRejected=El n\u00FAmero de l\u00EDneas rechazadas por el manejo de errores del paso durante el intervalo
PerformanceLogTable.FieldDescription.StepCopy=El n\u00FAmero de copia del paso\: 0..(copias-1)
TransLogTable.FieldDescription.StartDateRange=El comienzo del rango de fecha para el procesamiento incremental (CDC) de datos. Es el "final del rango de fechas" de la \u00FAltima vez que esta transformaci\u00F3n se ejecut\u00F3 correctamente.
TransLogTable.FieldDescription.DepDate=La fecha de dependencia\: la m\u00E1xima fecha calculada por las reglas de dependencia en los ajuste de transformaci\u00F3n.
TransLogTable.FieldDescription.LinesRead=El n\u00FAmero de l\u00EDneas le\u00EDdas por el paso indicado.
PerformanceLogTable.FieldDescription.LinesOutput=El n\u00FAmero de l\u00EDneas escritas a la salida (archivo, base de datos, red, ...) durante el intervalo
TransLogTable.FieldDescription.BatchID=El ID de lote. Es un n\u00FAmero \u00FAnico, incrementado en uno en cada ejecuci\u00F3n de una transformaci\u00F3n.
PerformanceLogTable.FieldDescription.InputBufferRows=El tama\u00F1o del buffer de entrada del paso, en filas, al momento de la captura
PerformanceLogTable.FieldDescription.TransName=El nombre de la transformaci\u00F3n para la cual se tom\u00F3 la captura de rendimiento
TransLogTable.FieldDescription.EndDateRange=El final del rango de fecha para el procesamiento incremental (CDC) de datos.
LogWriter.Level.Nothing.LongDesc=Absolutamente nada
TransLogTable.FieldDescription.LinesInput=El n\u00FAmero de l\u00EDneas le\u00EDdas desde disco \u00F3 red por el paso indicado. La entrada puede ser de archivos, base de datos, etc.
TransLogTable.FieldDescription.ChannelID=El ID del canal de log (GUID), puede ser apareado a la informaci\u00F3n de traza de log
PerformanceLogTable.FieldDescription.LinesInput=El n\u00FAmero de l\u00EDneas le\u00EDdas desde la entrada (archivo, base de datos, red, ...) durante el intervalo
LogWriter.Level.Basic.LongDesc=Logueo b\u00E1sico
TransLogTable.FieldDescription.LinesWritten=El n\u00FAmero de l\u00EDneas escritas por el paso especificado.
PerformanceLogTable.FieldDescription.StepName=El nombre del paso para el cual se tom\u00F3 la captura de rendimiento
PerformanceLogTable.FieldDescription.LinesUpdated=El n\u00FAmero de sentencias de actualizaci\u00F3n ejecutadas durante el intervalo
PerformanceLogTable.FieldDescription.BatchID=ID de lote
PerformanceLogTable.FieldDescription.OutputBufferRows=El tama\u00F1o del buffer de salida, en l\u00EDneas, al momento de la captura
TransLogTable.FieldDescription.Errors=El n\u00FAmero de errores ocurridos.
LogWriter.Level.Minimal.LongDesc=Logueo m\u00EDnimo
LogWriter.Level.Debug.LongDesc=Debugging
LogWriter.Level.Rowlevel.LongDesc=A nivel de fila (muy detallado)
TransLogTable.FieldDescription.LinesOutput=El n\u00FAmero de l\u00EDneas escritas a disco \u00F3 red por el paso indicado. La salida puede ser a archivos, base de datos, etc.
PerformanceLogTable.FieldDescription.Errors=Errores
TransLogTable.FieldDescription.Status=El estado de la transformaci\u00F3n\: iniciada, finalizada, detenida.
TransLogTable.FieldDescription.ReplayDate=La fecha de repetici\u00F3n es sin\u00F3nimo del momento de comienzo de la ejecuci\u00F3n de la transformaci\u00F3n.
PerformanceLogTable.FieldDescription.LinesRead=El n\u00FAmero de l\u00EDneas le\u00EDdas de pasos anteriores durante el intervalo
LogWriter.Level.Error.LongDesc=S\u00F3lo logueo de errores
PerformanceLogTable.FieldDescription.LinesWritten=El n\u00FAmero de l\u00EDneas escritas a los siguientes pasos durante el intervalo
TransLogTable.FieldDescription.TransName=El nombre de la transformaci\u00F3n
TransLogTable.FieldDescription.LogDate=El tiempo de actualizaci\u00F3n de este registro de log. Si la transformaci\u00F3n tiene est\u00E1tus "fin" es el final de la transformaci\u00F3n.
